; NOTE: Assertions have been autogenerated by utils/update_test_checks.py UTC_ARGS: --version 6
; RUN: opt < %s -passes='module(coro-early),cgscc(coro-split,coro-split)' -S | FileCheck %s

; Checks whether the dbg.declare for `__coro_frame` are created.

;
;


%promise_type = type { i32, i32, double }
%struct.big_structure = type { [500 x i8] }
declare void @produce(ptr)
declare void @consume(ptr)
declare void @produce_vector(ptr)
declare void @consume_vector(ptr)
declare void @produce_vectori5(ptr)
declare void @consume_vectori5(ptr)
declare void @produce_vectori9(ptr)
declare void @consume_vectori9(ptr)
declare void @pi32(ptr)
declare void @pi64(ptr)
declare void @pdouble(ptr)
declare void @pi64p(ptr)

define void @f(i32 %a, i32 %b, i64 %c, double %d, ptr %e) presplitcoroutine !dbg !8 {
; CHECK-LABEL: define void @f(
; CHECK-SAME: i32 [[A:%.*]], i32 [[B:%.*]], i64 [[C:%.*]], double [[D:%.*]], ptr [[E:%.*]]) !dbg [[DBG6:![0-9]+]] {
; CHECK-NEXT:  [[ENTRY:.*]]:
; CHECK-NEXT:    [[__PROMISE:%.*]] = alloca [[PROMISE_TYPE:%.*]], align 8
; CHECK-NEXT:    [[A_ALLOC:%.*]] = alloca i32, align 4
; CHECK-NEXT:    [[B_ALLOC:%.*]] = alloca i32, align 4
; CHECK-NEXT:    [[C_ALLOC:%.*]] = alloca i64, align 4
; CHECK-NEXT:    [[D_ALLOC:%.*]] = alloca double, align 4
; CHECK-NEXT:    [[E_ALLOC:%.*]] = alloca ptr, align 4
; CHECK-NEXT:    store i32 [[A]], ptr [[A_ALLOC]], align 4
; CHECK-NEXT:    store i32 [[B]], ptr [[B_ALLOC]], align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 11.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "coro-debug.cpp", directory: ".")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 11.0.0"}
!6 = !DILocalVariable(name: "__promise", scope: !7, file: !1, line: 24, type: !10)
!7 = distinct !DILexicalBlock(scope: !8, file: !1, line: 23, column: 12)
!8 = distinct !DISubprogram(name: "foo", linkageName: "_Z3foov", scope: !8, file: !1, line: 23, type: !9, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!9 = !DISubroutineType(types: !2)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "promise_type", scope: !8, file: !1, line: 15, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "promise_type", scope: !8, file: !1, line: 10, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !12, identifier: "_ZTSN4coro12promise_typeE")
!12 = !{!13, !14, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !8, file: !1, line: 10, baseType: !16, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !8, file: !1, line: 10, baseType: !16, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !8, file: !1, line: 10, baseType: !17, size: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!18 = !DILocation(line: 8, scope: !7)
!19 = distinct !DISubprogram(name: "bar", linkageName: "_Z3barv", scope: !19, file: !1, line: 54, type: !9, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!20 = distinct !DILexicalBlock(scope: !19, file: !1, line: 23, column: 12)
!21 = !DILocalVariable(name: "__promise", scope: !20, file: !1, line: 55, type: !10)
!22 = !DILocation(line: 10, scope: !20)
;.
; CHECK: [[META0:![0-9]+]] = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: [[META1:![0-9]+]], producer: "{{.*}}clang version {{.*}}", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: [[META2:![0-9]+]], retainedTypes: [[META2]], splitDebugInlining: false, nameTableKind: None)
; CHECK: [[META1]] = !DIFile(filename: "{{.*}}coro-debug.cpp", directory: {{.*}})
; CHECK: [[META2]] = !{}
; CHECK: [[DBG6]] = distinct !DISubprogram(name: "foo", linkageName: "_Z3foov", scope: [[DBG6]], file: [[META1]], line: 23, type: [[META7:![0-9]+]], scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: [[META0]], retainedNodes: [[META8:![0-9]+]])
; CHECK: [[META7]] = !DISubroutineType(types: [[META2]])
; CHECK: [[META8]] = !{[[META9]]}
; CHECK: [[META9]] = !DILocalVariable(name: "__coro_frame", scope: [[DBG6]], file: [[META1]], line: 23, type: [[META10:![0-9]+]], flags: DIFlagArtificial)
; CHECK: [[META10]] = !DICompositeType(tag: DW_TAG_structure_type, name: "f.coro_frame_ty", file: [[META1]], line: 23, size: 4736, align: 128, flags: DIFlagArtificial, elements: [[META11:![0-9]+]])
; CHECK: [[META11]] = !{[[META12:![0-9]+]], [[META14:![0-9]+]], [[META15:![0-9]+]], [[META24:![0-9]+]], [[META29:![0-9]+]], [[META31:![0-9]+]], [[META33:![0-9]+]], [[META35:![0-9]+]], [[META37:![0-9]+]], [[META38:![0-9]+]], [[META42:![0-9]+]], [[META49:![0-9]+]], [[META51:![0-9]+]]}
; CHECK: [[META12]] = !DIDerivedType(tag: DW_TAG_member, name: "__resume_fn", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META13:![0-9]+]], size: 64, align: 64, flags: DIFlagArtificial)
; CHECK: [[META13]] = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
; CHECK: [[META14]] = !DIDerivedType(tag: DW_TAG_member, name: "__destroy_fn", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META13]], size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
; CHECK: [[META15]] = !DIDerivedType(tag: DW_TAG_member, name: "__promise", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META16:![0-9]+]], size: 128, align: 64, offset: 128, flags: DIFlagArtificial)
; CHECK: [[META16]] = !DIDerivedType(tag: DW_TAG_typedef, name: "promise_type", scope: [[DBG6]], file: [[META1]], line: 15, baseType: [[META17:![0-9]+]])
; CHECK: [[META17]] = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "promise_type", scope: [[DBG6]], file: [[META1]], line: 10, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: [[META18:![0-9]+]], identifier: "_ZTSN4coro12promise_typeE")
; CHECK: [[META18]] = !{[[META19:![0-9]+]], [[META21:![0-9]+]], [[META22:![0-9]+]]}
; CHECK: [[META19]] = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: [[DBG6]], file: [[META1]], line: 10, baseType: [[META20:![0-9]+]], size: 32)
; CHECK: [[META20]] = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
; CHECK: [[META21]] = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: [[DBG6]], file: [[META1]], line: 10, baseType: [[META20]], size: 32, offset: 32)
; CHECK: [[META22]] = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: [[DBG6]], file: [[META1]], line: 10, baseType: [[META23:![0-9]+]], size: 64, offset: 64)
; CHECK: [[META23]] = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
; CHECK: [[META24]] = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META25:![0-9]+]], size: 128, align: 128, offset: 256, flags: DIFlagArtificial)
; CHECK: [[META25]] = !DICompositeType(tag: DW_TAG_array_type, baseType: [[META26:![0-9]+]], size: 128, align: 16, elements: [[META27:![0-9]+]])
; CHECK: [[META26]] = !DIBasicType(name: "UnknownType", size: 8, encoding: DW_ATE_unsigned_char, flags: DIFlagArtificial)
; CHECK: [[META27]] = !{[[META28:![0-9]+]]}
; CHECK: [[META28]] = !DISubrange(count: 16, lowerBound: 0)
; CHECK: [[META29]] = !DIDerivedType(tag: DW_TAG_member, name: "__int_64_1", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META30:![0-9]+]], size: 64, align: 32, offset: 384, flags: DIFlagArtificial)
; CHECK: [[META30]] = !DIBasicType(name: "__int_64", size: 64, encoding: DW_ATE_signed, flags: DIFlagArtificial)
; CHECK: [[META31]] = !DIDerivedType(tag: DW_TAG_member, name: "__double__2", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META32:![0-9]+]], size: 64, align: 32, offset: 448, flags: DIFlagArtificial)
; CHECK: [[META32]] = !DIBasicType(name: "__double_", size: 64, encoding: DW_ATE_float, flags: DIFlagArtificial)
; CHECK: [[META33]] = !DIDerivedType(tag: DW_TAG_member, name: "PointerType_3", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META34:![0-9]+]], size: 64, align: 32, offset: 512, flags: DIFlagArtificial)
; CHECK: [[META34]] = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PointerType", baseType: null, size: 64, align: 64)
; CHECK: [[META35]] = !DIDerivedType(tag: DW_TAG_member, name: "__int_32_4", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META36:![0-9]+]], size: 32, align: 32, offset: 576, flags: DIFlagArtificial)
; CHECK: [[META36]] = !DIBasicType(name: "__int_32", size: 32, encoding: DW_ATE_signed, flags: DIFlagArtificial)
; CHECK: [[META37]] = !DIDerivedType(tag: DW_TAG_member, name: "__int_32_5", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META36]], size: 32, align: 32, offset: 608, flags: DIFlagArtificial)
; CHECK: [[META38]] = !DIDerivedType(tag: DW_TAG_member, name: "_6", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META39:![0-9]+]], size: 9, align: 16, offset: 640, flags: DIFlagArtificial)
; CHECK: [[META39]] = !DICompositeType(tag: DW_TAG_array_type, baseType: [[META26]], size: 16, align: 2, elements: [[META40:![0-9]+]])
; CHECK: [[META40]] = !{[[META41:![0-9]+]]}
; CHECK: [[META41]] = !DISubrange(count: 2, lowerBound: 0)
; CHECK: [[META42]] = !DIDerivedType(tag: DW_TAG_member, name: "struct_big_structure_7", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META43:![0-9]+]], size: 4000, align: 8, offset: 656, flags: DIFlagArtificial)
; CHECK: [[META43]] = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_big_structure", scope: [[META10]], file: [[META1]], line: 23, size: 4000, align: 64, flags: DIFlagArtificial, elements: [[META44:![0-9]+]])
; CHECK: [[META44]] = !{[[META45:![0-9]+]]}
; CHECK: [[META45]] = !DIDerivedType(tag: DW_TAG_member, scope: [[META43]], file: [[META1]], line: 23, baseType: [[META46:![0-9]+]], size: 4000, align: 1, flags: DIFlagArtificial)
; CHECK: [[META46]] = !DICompositeType(tag: DW_TAG_array_type, baseType: [[META26]], size: 4000, align: 1, elements: [[META47:![0-9]+]])
; CHECK: [[META47]] = !{[[META48:![0-9]+]]}
; CHECK: [[META48]] = !DISubrange(count: 500, lowerBound: 0)
; CHECK: [[META49]] = !DIDerivedType(tag: DW_TAG_member, name: "__coro_index", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META50:![0-9]+]], size: 2, align: 8, offset: 4656, flags: DIFlagArtificial)
; CHECK: [[META50]] = !DIBasicType(name: "__coro_index", size: 8, encoding: DW_ATE_unsigned_char)
; CHECK: [[META51]] = !DIDerivedType(tag: DW_TAG_member, name: "UnknownType_8", scope: [[META10]], file: [[META1]], line: 23, baseType: [[META26]], size: 5, align: 8, offset: 4664, flags: DIFlagArtificial)
; CHECK: [[META52]] = !DILocalVariable(name: "__promise", scope: [[META53:![0-9]+]], file: [[META1]], line: 24, type: [[META16]])
; CHECK: [[META53]] = distinct !DILexicalBlock(scope: [[DBG6]], file: [[META1]], line: 23, column: 12)
; CHECK: [[META54]] = !DILocation(line: 8, scope: [[META53]])
; CHECK: [[META55]] = !DILocation(line: 23, column: 1, scope: [[DBG6]])
; CHECK: [[DBG56]] = distinct !DISubprogram(name: "bar", linkageName: "_Z3barv", scope: [[DBG56]], file: [[META1]], line: 54, type: [[META7]], scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: [[META0]], retainedNodes: [[META57:![0-9]+]])
; CHECK: [[META57]] = !{[[META58]]}
; CHECK: [[META58]] = !DILocalVariable(name: "__coro_frame", scope: [[DBG56]], file: [[META1]], line: 54, type: [[META59:![0-9]+]], flags: DIFlagArtificial)
; CHECK: [[META59]] = !DICompositeType(tag: DW_TAG_structure_type, name: "bar.coro_frame_ty", file: [[META1]], line: 54, size: 4736, align: 128, flags: DIFlagArtificial, elements: [[META60:![0-9]+]])
; CHECK: [[META60]] = !{[[META61:![0-9]+]], [[META62:![0-9]+]], [[META63:![0-9]+]], [[META64:![0-9]+]], [[META65:![0-9]+]], [[META66:![0-9]+]], [[META67:![0-9]+]], [[META68:![0-9]+]], [[META69:![0-9]+]], [[META73:![0-9]+]]}
; CHECK: [[META61]] = !DIDerivedType(tag: DW_TAG_member, name: "__resume_fn", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META13]], size: 64, align: 64, flags: DIFlagArtificial)
; CHECK: [[META62]] = !DIDerivedType(tag: DW_TAG_member, name: "__destroy_fn", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META13]], size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
; CHECK: [[META63]] = !DIDerivedType(tag: DW_TAG_member, name: "__promise", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META16]], size: 128, align: 64, offset: 128, flags: DIFlagArtificial)
; CHECK: [[META64]] = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META25]], size: 128, align: 128, offset: 256, flags: DIFlagArtificial)
; CHECK: [[META65]] = !DIDerivedType(tag: DW_TAG_member, name: "__int_64_1", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META30]], size: 64, align: 32, offset: 384, flags: DIFlagArtificial)
; CHECK: [[META66]] = !DIDerivedType(tag: DW_TAG_member, name: "__double__2", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META32]], size: 64, align: 32, offset: 448, flags: DIFlagArtificial)
; CHECK: [[META67]] = !DIDerivedType(tag: DW_TAG_member, name: "PointerType_3", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META34]], size: 64, align: 32, offset: 512, flags: DIFlagArtificial)
; CHECK: [[META68]] = !DIDerivedType(tag: DW_TAG_member, name: "__int_32_4", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META36]], size: 32, align: 32, offset: 576, flags: DIFlagArtificial)
; CHECK: [[META69]] = !DIDerivedType(tag: DW_TAG_member, name: "struct_big_structure_5", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META70:![0-9]+]], size: 4000, align: 8, offset: 608, flags: DIFlagArtificial)
; CHECK: [[META70]] = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_big_structure", scope: [[META59]], file: [[META1]], line: 54, size: 4000, align: 64, flags: DIFlagArtificial, elements: [[META71:![0-9]+]])
; CHECK: [[META71]] = !{[[META72:![0-9]+]]}
; CHECK: [[META72]] = !DIDerivedType(tag: DW_TAG_member, scope: [[META70]], file: [[META1]], line: 54, baseType: [[META46]], size: 4000, align: 1, flags: DIFlagArtificial)
; CHECK: [[META73]] = !DIDerivedType(tag: DW_TAG_member, name: "__coro_index", scope: [[META59]], file: [[META1]], line: 54, baseType: [[META50]], size: 2, align: 8, offset: 4608, flags: DIFlagArtificial)
; CHECK: [[META74]] = !DILocalVariable(name: "__promise", scope: [[META75:![0-9]+]], file: [[META1]], line: 55, type: [[META16]])
; CHECK: [[META75]] = distinct !DILexicalBlock(scope: [[DBG56]], file: [[META1]], line: 23, column: 12)
; CHECK: [[META76]] = !DILocation(line: 10, scope: [[META75]])
; CHECK: [[META77]] = !DILocation(line: 54, column: 1, scope: [[DBG56]])
;.
